sonarcloud issues fixed
